---
title: DuctLining
classe: Autodesk.Revit.DB.Mechanical.DuctLining
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.InsulationLiningBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# DuctLining

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `DuctLining Create(Document, ElementId, ElementId, Double)` | `DuctLining.Create(document, ductOrContentElementId, ductLiningTypeId, Thickness)` | DuctLining |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```